In [142]:
import pandas as pd
import pymysql
from sqlalchemy import create_engine

# Connection and table import

In [143]:
DATABASE_PATH = '/home/cristina/ironhack/Ironhack-Module-1-Project-Mecaho/data/raw/cortega.db'
engine = create_engine(f'sqlite:///{DATABASE_PATH}')
rank_info = pd.read_sql_query("select * from rank_info", engine)
display(rank_info)

        id                         name  position  Unnamed: 0
0     4513  anant asAVABHOKHIN & FAMILY       NaN           0
1     8342               araSH FERDOwsi       NaN           1
2     9217     baNTHOON LAMSAM & FAMILY       NaN           2
3     9846       bill addERLEY & FAMILy       NaN           3
4     2255            boris zINGAREVICH       NaN           4
...    ...                          ...       ...         ...
2255  3917               ZHAO XIAOQIang    2204.0        2255
2256  3721              zhou liANgzhang    2205.0        2256
2257  6132                 zhU XINGMING    2206.0        2257
2258  7866                     zhuo JUN    2207.0        2258
2259  2968                  olGUN ZOrlu    2208.0        2259

[2260 rows x 4 columns]

In [144]:
#Check types:
rank_info.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2260 entries, 0 to 2259
Data columns (total 4 columns):
id            2260 non-null int64
name          2260 non-null object
position      2208 non-null float64
Unnamed: 0    2260 non-null int64
dtypes: float64(1), int64(2), object(1)
memory usage: 210.2 KB

In [145]:
#Null check:
null_cols = rank_info.isnull().sum()
display(null_cols)
null_cols[null_cols>0]/len(rank_info)*100

id             0
name           0
position      52
Unnamed: 0     0
dtype: int64

position    2.300885
dtype: float64

In [148]:
#'Position':
#Check null values:
before = len(rank_info)
rank_info = rank_info.dropna()
after = len(rank_info)
print(f'Number of duplicate records dropped: {before - after}')

Number of duplicate records dropped: 52

In [150]:
#Delete de .0 in 'position' and transform into integrer:
rank_info['position'] = rank_info['position'].astype('int64')
rank_info.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2208 entries, 52 to 2259
Data columns (total 4 columns):
id            2208 non-null int64
name          2208 non-null object
position      2208 non-null int64
Unnamed: 0    2208 non-null int64
dtypes: int64(3), object(1)
memory usage: 222.3 KB

In [151]:
#'Name':
#Transform 'into a MAYUS string:
rank_info['name'] = rank_info['name'].str.capitalize()

In [152]:
#Delete the column 'Unnamed:0':
after = len(rank_info.columns)
rank_info = rank_info.drop(['Unnamed: 0'], axis=1)
before = len(rank_info.columns)
print(f'Number of columns dropped: {after - before}')
display(rank_info)

Number of columns dropped: 1

        id             name  position
52    5948       Jeff bezos         1
53    7342       Bill gates         2
54    5447   Warren buffett         3
55    4420  Bernard arnault         4
56    4071  Mark zuckerberg         5
...    ...              ...       ...
2255  3917   Zhao xiaoqiang      2204
2256  3721  Zhou liangzhang      2205
2257  6132     Zhu xingming      2206
2258  7866         Zhuo jun      2207
2259  2968      Olgun zorlu      2208

[2208 rows x 3 columns]

In [114]:
#Duplicates:
#dupli_id = [rank_info['id'].duplicated()]=='True'
#display(dupli_id)
#dupli_name = rank_info['name'].duplicated()
#dupli_position = rank_info['position'].duplicated()

False

In [153]:
#Reset index:
rank_info = rank_info.reset_index(drop=True)
display(rank_info)

        id             name  position
0     5948       Jeff bezos         1
1     7342       Bill gates         2
2     5447   Warren buffett         3
3     4420  Bernard arnault         4
4     4071  Mark zuckerberg         5
...    ...              ...       ...
2203  3917   Zhao xiaoqiang      2204
2204  3721  Zhou liangzhang      2205
2205  6132     Zhu xingming      2206
2206  7866         Zhuo jun      2207
2207  2968      Olgun zorlu      2208

[2208 rows x 3 columns]